// src/screens/other.ts

import { InlineKeyboard } from 'grammy'
import { FormattedString } from '@grammyjs/parse-mode'

import { packCb } from '../core/callback.js'
import type { ScreenView } from '../core/render.js'

export function otherScreen(userId: number): ScreenView {
  const kb = new InlineKeyboard()

  kb.url('ЧАТ С АДМИНОМ', 'https://t.me/k1r4r1k').icon('5465300082628763143').row()

  kb.text('◀️ НАЗАД', packCb({ a: 'back' }))

  // ============================================================
  // ТЕКСТ
  // ============================================================

  let message = new FormattedString('')

  // ============================================================
  // ЗАГОЛОВОК
  // ============================================================

  message = message.bold('ДРУГИЕ СЕРВИСЫ').plain('\n\n')

  // ============================================================
  // ОПИСАНИЕ
  // ============================================================

  message = message
    .plain(
      'Если вам нужна цифровая подписка или сервис, который недоступен в РФ, мы поможем подобрать способ оплаты и подключить его.'
    )
    .plain('\n\n')

  // ============================================================
  // ЧТО МОЖЕМ ОПЛАТИТЬ
  // ============================================================

  let services = new FormattedString('')

  services = services
    .emoji('💎', '5980930633298350051')
    .plain(
      ' Премиум-сервисы: программы, облачные сервисы, библиотеки контента и многое другое.\n\n'
    )

    .emoji('🔐', '5980930633298350051')
    .plain(' Доступ к аккаунтам, потокам и лицензиям.\n\n')

    .emoji('🎵', '5980930633298350051')
    .plain(' Всё, что связано с worship, музыкой, видео и софтом для церквей.')

  message = message.blockquote(services, true).plain('\n\n')

  // ============================================================
  // ФИНАЛЬНЫЙ ТЕКСТ
  // ============================================================

  message = message.plain(
    'Просто напишите админу в чат — обсудим детали, стоимость и сроки. Мы подберём оптимальный способ оплаты и предоставим доступ на ваш аккаунт.'
  )

  // ============================================================
  // RETURN
  // ============================================================

  return {
    photo: './public/others.jpg',
    caption: message.caption,
    caption_entities: message.caption_entities,
    keyboard: kb,
  }
}
